MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_audio_in.c
  BlueCoin_Audio_Handler.DecimationFactor = (BlueCoin_Audio_Handler.PDM_Clock_Freq * 1000) /
  BlueCoin_Audio_Handler.PCM_Sampling_Freq;
  BlueCoin_Audio_Handler.PdmBufferSize = (BlueCoin_Audio_Handler.PDM_Clock_Freq / 8) * 2 * N_MS_PER_INTERRUPT;
  BSP_Mic234_Clock_Selector_Init();
  
  uint16_t PDM_I2S_Clock = BlueCoin_Audio_Handler.PDM_Clock_Freq;
  
  if (BlueCoin_Audio_Handler.MicChannels > 1)
  {
    PDM_I2S_Clock *= 2;  /*Clock to be generated is twice the PDM clock */
    /*Timer Init*/
    if (AUDIO_IN_Timer_Init() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
  BSP_AUDIO_IN_ClockConfig(NULL, BlueCoin_Audio_Handler.PCM_Sampling_Freq, &(PDM_I2S_Clock));
  
  /* I2S Peripheral configuration */
  hAudioInI2s.Instance          = AUDIO_IN_I2S_INSTANCE;
  __HAL_I2S_DISABLE(&hAudioInI2s);
  
  if(BlueCoin_Audio_Handler.MicChannels == 1)
  {
    hAudioInI2s.Init.DataFormat   = I2S_DATAFORMAT_16B;
    BSP_Mic234_Clock_Selector_Set(CLK_DISABLE);
  }
  else
  {
    hAudioInI2s.Init.DataFormat   = I2S_DATAFORMAT_32B;
    BSP_Mic234_Clock_Selector_Set(CLK_ENABLE);
  }
  
  hAudioInI2s.Init.AudioFreq = ((BlueCoin_Audio_Handler.PDM_Clock_Freq * 1000) / 32);
  hAudioInI2s.Init.ClockSource  = I2S_CLOCK_PLL;
  hAudioInI2s.Init.CPOL         = I2S_CPOL_HIGH;
  hAudioInI2s.Init.MCLKOutput   = I2S_MCLKOUTPUT_DISABLE;
  hAudioInI2s.Init.Mode         = I2S_MODE_MASTER_RX;
  hAudioInI2s.Init.Standard     = I2S_STANDARD_MSB;
  hAudioInI2s.Init.FullDuplexMode   = I2S_FULLDUPLEXMODE_DISABLE;
  
  if(HAL_I2S_GetState(&hAudioInI2s) == HAL_I2S_STATE_RESET)
  {
    AUDIO_IN_I2S_MspInit();
  }
  
  if(HAL_I2S_Init(&hAudioInI2s) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  /*End I2S Init*/
  
  /*SPI Init*/
  if(BlueCoin_Audio_Handler.MicChannels > 2)
  {
    /* Set the SPI parameters */
    hAudioInSPI.Instance               = AUDIO_IN_SPI_INSTANCE;
    hAudioInSPI.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
    hAudioInSPI.Init.Direction         = SPI_DIRECTION_2LINES_RXONLY;
    hAudioInSPI.Init.CLKPhase          = SPI_PHASE_2EDGE;
    hAudioInSPI.Init.CLKPolarity       = SPI_POLARITY_HIGH;
    hAudioInSPI.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLED;
    hAudioInSPI.Init.CRCPolynomial     = 7;
    hAudioInSPI.Init.DataSize          = SPI_DATASIZE_16BIT;
    hAudioInSPI.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    hAudioInSPI.Init.NSS               = SPI_NSS_SOFT;
    hAudioInSPI.Init.TIMode            = SPI_TIMODE_DISABLED;
    hAudioInSPI.Init.Mode              = SPI_MODE_SLAVE;
    
    /* Initialize the I2S peripheral with the structure above */
    if(HAL_SPI_GetState(&hAudioInSPI) == HAL_SPI_STATE_RESET)
    {
      AUDIO_IN_SPI_MspInit();
    }
    if(HAL_SPI_Init(&hAudioInSPI) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }
  /*End SPI init*/
  
  /*PDM Filter Init*/
  
    uint32_t index = 0;

  /* Enable CRC peripheral to unlock the PDM library */
  __HAL_RCC_CRC_CLK_ENABLE();

  for(index = 0; index < ChnlNbr; index++)
  {
    volatile uint32_t error = 0;
    /* Init PDM filters */
    lib_PDM_Filter_Handler_Instance[index].bit_order  = PDM_FILTER_BIT_ORDER_LSB;
    lib_PDM_Filter_Handler_Instance[index].endianness = PDM_FILTER_ENDIANNESS_LE;
    lib_PDM_Filter_Handler_Instance[index].high_pass_tap = 2122358088;
    lib_PDM_Filter_Handler_Instance[index].out_ptr_channels = ChnlNbr;
    lib_PDM_Filter_Handler_Instance[index].in_ptr_channels  = ChnlNbr;
    error = PDM_Filter_Init((PDM_Filter_Handler_t *)(&lib_PDM_Filter_Handler_Instance[index]));
    
    if(error!=0)
    {
      while(1);
    }

    /* PDM lib config phase */
    lib_PDM_Filter_Config_Instance[index].output_samples_number = AudioFreq/1000;
    lib_PDM_Filter_Config_Instance[index].mic_gain = 24;
    
    switch (BlueCoin_Audio_Handler.DecimationFactor)
    {
    case 16:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_16;
      break;
    case 24:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_24;
      break;
    case 32:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_32;
      break;
    case 48:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_48;
      break;
    case 64:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_64;
      break;
    case 80:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_80;
      break;
    case 128:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_128;
      break;
    case 160:
      lib_PDM_Filter_Config_Instance[index].decimation_factor = PDM_FILTER_DEC_FACTOR_80;
      break;
    default:
      return AUDIO_ERROR;
    }
    error = PDM_Filter_setConfig((PDM_Filter_Handler_t *)&lib_PDM_Filter_Handler_Instance[index], &lib_PDM_Filter_Config_Instance[index]);
    
    if(error!=0)
    {
      while(1);
    }

  }
                             
  /*End PDM Filter Init*/
  
  return AUDIO_OK;
}

/**
* @brief  Clock Config.

* @param  hi2s: I2S handle if required
* @param  Params: additional parameters where required
* @param  AudioFreq: Audio frequency used to play the audio stream.
* @note   This API is called by BSP_AUDIO_IN_Init()
*         Being __weak it can be overwritten by the application
* @retval AUDIO_OK if no problem during execution, AUDIO_ERROR otherwise
*/
__weak uint8_t BSP_AUDIO_IN_ClockConfig(I2S_HandleTypeDef *hi2s, uint32_t AudioFreq, void *Params)
{
  /*I2S PLL Configuration*/
  RCC_PeriphCLKInitTypeDef rccclkinit;
  HAL_RCCEx_GetPeriphCLKConfig(&rccclkinit);
  
  
  rccclkinit.PLLI2S.PLLI2SQ = 2;
  rccclkinit.PLLI2SDivQ = 1;
  
  if ((*(uint16_t *)Params) % 1280 == 0)
  {
    rccclkinit.PLLI2S.PLLI2SM = 10;
    rccclkinit.PLLI2S.PLLI2SN = 192;
    rccclkinit.PLLI2S.PLLI2SR = 5;
  }
  else
  {
    rccclkinit.PLLI2S.PLLI2SM = 16;
    rccclkinit.PLLI2S.PLLI2SN = 344;
    rccclkinit.PLLI2S.PLLI2SR = 7;
  }
  
