MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_audio_in.c
  rccclkinit.PeriphClockSelection = RCC_PERIPHCLK_I2S_APB2;
  
  if(HAL_RCCEx_PeriphCLKConfig(&rccclkinit) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  
  return AUDIO_OK;
}

/**
* @brief  Starts audio recording.
* @param  * pbuf: Buffer that will contain 1 ms of PDM for each microphone.
Its dimension must be equal to (in uint16_t words):
((PCM sampling frequency)/1000 * DecimationFactor * Channels)/16
DecimationFactor is equal to 128 for 8000 KHZ sampling frequency, 64 in all the other cases
* @param  size: Not used in this driver.
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Record(uint16_t * pbuf, uint32_t size)
{

  BlueCoin_Audio_Handler.PDM_Data = pbuf;
  if(BlueCoin_Audio_Handler.MicChannels > 2)
  {
    if(HAL_SPI_Receive_DMA(&hAudioInSPI, (uint8_t *)SPI_InternalBuffer, BlueCoin_Audio_Handler.PdmBufferSize) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
  if(BlueCoin_Audio_Handler.MicChannels != 1)
  {
    if(AUDIO_IN_Timer_Start() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  
  
  if(HAL_I2S_Receive_DMA(&hAudioInI2s, I2S_InternalBuffer, BlueCoin_Audio_Handler.PdmBufferSize / 2) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
* @brief  Stops audio recording.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Stop(void)
{
  if(BlueCoin_Audio_Handler.MicChannels > 2)
  {
    HAL_SPI_DMAStop(&hAudioInSPI);
  }
  
  if(AUDIO_IN_Timer_Stop() != AUDIO_OK)
  {
    return AUDIO_ERROR;
  }
  if(HAL_I2S_DMAStop(&hAudioInI2s) != HAL_OK)
  {
    return AUDIO_ERROR;
  }
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
* @brief  Controls the audio in volume level.
* @param  Volume: Volume level to be set for the PDM to PCM conversion.
Values will be converted in the range from -12dB to 51dB
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume)
{
  uint32_t index = 0;
  volatile uint32_t error = 0;
  
  /* Set mic_gain */
  
  for(index = 0; index < BlueCoin_Audio_Handler.MicChannels; index++)
  {
    if (lib_PDM_Filter_Config_Instance[index].mic_gain != VolumeGain[Volume])
    {
      lib_PDM_Filter_Config_Instance[index].mic_gain =  VolumeGain[Volume]; 
      error = PDM_Filter_setConfig((PDM_Filter_Handler_t *)&lib_PDM_Filter_Handler_Instance[index], &lib_PDM_Filter_Config_Instance[index]);
      
      if(error!=0)
      {
        while(1);
      }
    }
  }
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief  Converts audio format from PDM to PCM.
* @param  PDMBuf: Pointer to PDM buffer data
* @param  PCMBuf: Pointer to PCM buffer data
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
__weak uint8_t BSP_AUDIO_IN_PDMToPCM(uint16_t *PDMBuf, uint16_t *PCMBuf)
{  
  uint32_t index = 0;  
  uint32_t index_ms = 0;
  uint16_t PDM_Offset = (BlueCoin_Audio_Handler.PdmBufferSize / (2 * N_MS_PER_INTERRUPT)) * BlueCoin_Audio_Handler.MicChannels;
  uint16_t PCM_Offset = (BlueCoin_Audio_Handler.MicChannels * (BlueCoin_Audio_Handler.PCM_Sampling_Freq / 1000));
  
  for (index_ms = 0; index_ms < N_MS_PER_INTERRUPT; index_ms ++)
  {
      for(index = 0; index < BlueCoin_Audio_Handler.MicChannels; index++)
      {
        PDM_Filter(&((uint8_t*)(PDMBuf))[index + index_ms * PDM_Offset], (uint16_t*)&(PCMBuf[index + index_ms * PCM_Offset]) , (PDM_Filter_Handler_t*)&lib_PDM_Filter_Handler_Instance[index]);
      }

  }
  
  return AUDIO_OK;
}

/**
* @brief  Pauses the audio file stream.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Pause(void)
{
  /* Call the Media layer pause function */
  HAL_I2S_DMAPause(&hAudioInI2s);
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
* @brief  Resumes the audio file stream.
* @param  None
* @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
*/
uint8_t BSP_AUDIO_IN_Resume(void)
{
  /* Call the Media layer pause/resume function */
  HAL_I2S_DMAResume(&hAudioInI2s);
  
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}


/**
* @brief Rx Transfer completed callbacks. It performs demuxing of the bit-interleaved PDM streams into
byte-interleaved data suitable for PDM to PCM conversion. 1 ms of data for each microphone is
written into the buffer that the user indicates when calling the BSP_AUDIO_IN_Start(...) function.
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{

  uint32_t index = 0;
  
  switch(BlueCoin_Audio_Handler.MicChannels)
  {
    case 1:
    {
      uint16_t * DataTempI2S = &I2S_InternalBuffer[BlueCoin_Audio_Handler.PdmBufferSize / 4] ;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 4; index++)
      {
        BlueCoin_Audio_Handler.PDM_Data[index] = HTONS(DataTempI2S[index]);
      }
      break;
    }
    
    case 2:
    {
      uint16_t * DataTempI2S = &(I2S_InternalBuffer[BlueCoin_Audio_Handler.PdmBufferSize / 2]);
      uint8_t a, b = 0;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 2; index++)
      {
        a = ((uint8_t *)(DataTempI2S))[(index * 2)];
        b = ((uint8_t *)(DataTempI2S))[(index * 2) + 1];
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 2)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
            Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 2) + 1] = Channel_Demux[(a >> 1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b >> 1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;
    }
    case 4:
    {
      uint16_t * DataTempI2S = &(I2S_InternalBuffer[BlueCoin_Audio_Handler.PdmBufferSize / 2]);
      uint16_t * DataTempSPI = &(SPI_InternalBuffer[BlueCoin_Audio_Handler.PdmBufferSize / 2]);
      uint8_t a, b = 0;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 2; index++)
      {
      
