MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_audio_in.c
        a = ((uint8_t *)(DataTempI2S))[(index * 2)];
        b = ((uint8_t *)(DataTempI2S))[(index * 2) + 1];
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
            Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4) + 1] = Channel_Demux[(a >> 1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b >> 1) & CHANNEL_DEMUX_MASK] << 4;
            
        a = ((uint8_t *)(DataTempSPI))[(index * 2)];
        b = ((uint8_t *)(DataTempSPI))[(index * 2) + 1];
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4) + 2] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
            Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4) + 3] = Channel_Demux[(a >> 1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b >> 1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;
    }
    default:
    {
    
      break;
    }
    
  }
  
  BSP_AUDIO_IN_TransferComplete_CallBack();
}

/**
* @brief Rx Transfer completed callbacks. It performs demuxing of the bit-interleaved PDM streams into
byte-interleaved data suitable for PDM to PCM conversion. 1 ms of data for each microphone is
written into the buffer that the user indicates when calling the BSP_AUDIO_IN_Start(...) function.
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  uint32_t index = 0;
  switch(BlueCoin_Audio_Handler.MicChannels)
  {
    case 1:
    {
      uint16_t * DataTempI2S = I2S_InternalBuffer;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 4; index++)
      {
        BlueCoin_Audio_Handler.PDM_Data[index] = HTONS(DataTempI2S[index]);
      }
      break;
    }
    case 2:
    {
      uint16_t * DataTempI2S = I2S_InternalBuffer;
      uint8_t a, b = 0;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 2; index++)
      {
        a = ((uint8_t *)(DataTempI2S))[(index * 2)];
        b = ((uint8_t *)(DataTempI2S))[(index * 2) + 1];
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 2)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
            Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 2) + 1] = Channel_Demux[(a >> 1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b >> 1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;
    }
    case 4:
    {
      uint16_t * DataTempI2S = I2S_InternalBuffer;
      uint16_t * DataTempSPI = SPI_InternalBuffer;
      uint8_t a, b = 0;
      for(index = 0; index < BlueCoin_Audio_Handler.PdmBufferSize / 2; index++)
      {
        a = ((uint8_t *)(DataTempI2S))[(index * 2)];
        b = ((uint8_t *)(DataTempI2S))[(index * 2) + 1];
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4)] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
            Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4) + 1] = Channel_Demux[(a >> 1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b >> 1) & CHANNEL_DEMUX_MASK] << 4;
            
        a = ((uint8_t *)(DataTempSPI))[(index * 2)];
        b = ((uint8_t *)(DataTempSPI))[(index * 2) + 1];
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4) + 2] = Channel_Demux[a & CHANNEL_DEMUX_MASK] |
            Channel_Demux[b & CHANNEL_DEMUX_MASK] << 4;;
        ((uint8_t *)(BlueCoin_Audio_Handler.PDM_Data))[(index * 4) + 3] = Channel_Demux[(a >> 1) & CHANNEL_DEMUX_MASK] |
            Channel_Demux[(b >> 1) & CHANNEL_DEMUX_MASK] << 4;
      }
      break;
    }
    default:
    {
      break;
    }
    
  }
  
  BSP_AUDIO_IN_HalfTransfer_CallBack();
}

/**
* @brief  User callback when record buffer is filled.
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
* @brief  User callback when record buffer is half filled.
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
* @brief  Audio IN Error callback function
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_Error_Callback(void)
{
  /* This function is called when an Interrupt due to transfer error on or peripheral
  error occurs. */
}

/**
* @brief I2S error callbacks
* @param hi2s: I2S handle
* @retval None
*/
void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
  /* Manage the error generated on DMA FIFO: This function
  should be coded by user (its prototype is already declared in stm32f4_discovery_audio.h) */
  if(hi2s->Instance == AUDIO_IN_I2S_INSTANCE)
  {
    BSP_AUDIO_IN_Error_Callback();
  }
}

/**
* @}
*/


/** @defgroup BlueCoin_Audio_IN_Private_Functions BlueCoin_Audio_IN_Private_Functions
* @{
*/


/**
* @brief AUDIO IN I2S MSP Init
* @param None
* @retval None
*/
static void AUDIO_IN_I2S_MspInit(void)
{
  static DMA_HandleTypeDef hdma_i2sRx;
  GPIO_InitTypeDef  GPIO_InitStruct;
  I2S_HandleTypeDef *hi2s = &hAudioInI2s;
  
  /* Enable the I2S2 peripheral clock */
  AUDIO_IN_I2S_CLK_ENABLE();
  
  /* Enable I2S GPIO clocks */
  AUDIO_IN_I2S_MOSI_GPIO_CLK_ENABLE();
  
  if (BlueCoin_Audio_Handler.MicChannels == 1)
  {
    AUDIO_IN_1CH_I2S_SCK_GPIO_CLK_ENABLE();
    GPIO_InitStruct.Pin       = AUDIO_IN_1CH_I2S_SCK_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
    
